// 哈希表 + 子数组和(乘积)(余数) (求连续的)
  // 523. 连续的子数组和(**)
  // 560. 和为K的子数组(**)
  // 974. 和可被 K 整除的子数组(**)
// 子数组和(乘积)(余数)
  // 724. 寻找数组的中心索引(*)
// 双指针法
  // 88. 合并两个有序数组(*)
  // 713. 乘积小于K的子数组(**)
  // 1395. 统计作战单位数(**)
// 递归 / 栈 / 队列
  // 394. 字符串解码(**)
  // 70. 爬楼梯(二叉树的递归2^n)(*)
// 二分法(i=mid,j=mid+1)
  // 278. 第一个错误的版本(*)
// 动态规划
  // 53. 最大子序和(*)
  // 70. 爬楼梯(*)
  // 198. 打家劫舍(*)
// 斐波那契数列
  // 70. 爬楼梯(*)
// 设计问题
  // 384. 打乱数组(**)
  // 155. 最小栈(*)

// todo:
// 446. 等差数列划分 II - 子序列
// 691. 贴纸拼词
// 837. 新21点